/* Copyright 2016 Google Inc. All rights reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifndef VR_GVR_CAPI_INCLUDE_GVR_TYPES_H_
#define VR_GVR_CAPI_INCLUDE_GVR_TYPES_H_

#include <stdbool.h>
#include <stdint.h>
#include "mjtype.h"

#ifdef __cplusplus
extern "C" {
#endif

/// @defgroup types Google VR Types
/// @brief Various types used in the Google VR NDK.
/// @{

typedef struct st110B38_mj
{
    void *pfun00;
    void *pfun01;
    void *pfun02;
    void *pfun03;
    void *pfun04;
    void *pfun05;
    fn_initialize_gl pfun06;
    void *pfun07;
    void *pfun08;
    void *pfun09;
    fn_buffer_spec_create pfun10;
    void *pfun11;
    void *pfun12;
    void *pfun13;
    void *pfun14;
    void *pfun15;
    void *pfun16;
    void *pfun17;
    void *pfun18;
    void *pfun19;
    void *pfun20;
    void *pfun21;
    void *pfun22;
    void *pfun23;
    void *pfun24;
    void *pfun25;
    void *pfun26;
    void *pfun27;
    void *pfun28;
    void *pfun29;
    void *pfun30;
    void *pfun31;
    void *pfun32;
    void *pfun33;
    void *pfun34;
    void *pfun35;
    fn_resume_tracking pfun36;
    void *pfun37;
    void *pfun38;
    void *pfun39;
    void *pfun40;
    void *pfun41;
    void *pfun42;
    fn_get_viewer_type pfun43;
    void *pfun44;
    void *pfun45;
    void *pfun46;
    void *pfun47;
    void *pfun48;
    void *pfun49;
}st110B38;

typedef struct st1109B0_mj
{
    uint32_t pfun[7];
}st1109B0;

typedef struct st112198_mj
{
    uint32_t pfun[17];
}st112198;

typedef struct st114D98_mj
{
    uint32_t pfun[17];
}st114D98;

typedef struct gvr_user_prefs_mj{
//    char data[600];
    st110B38 *p001;        //4
    char data[8];         //12
    int i12;              //16
    int i16;              //20
    int i20;              //24
    int i24;              //28
    char data0_0_0[4];    //32
    int i32;              //36
    void *p36;            //40
    int   i40;            //44;
    int   i44;            //48
    int   i48;            //52;
    int   i52;            //56;
    int   i56;            //60
    int   i60;            //64
    int   i64;            //68
    int   i68;            //72
    int   i72;            //76
    int   i76;            //80
    st1109B0 *p80;        //84;
    int (*sub_24FD0)(int a1); //88
    int  i88;             //92
    void *p92;            //96
    char data96[24];      //120
    int i120;              //124
    char data0_0[20];
    void (*resume_tracking)() = NULL;       //148
    int i148;                               //152
    int i152;                               //156
    int i156;                               //160
    void(*refresh_viewer_profile)() = NULL; //164
    char data164[4];                        //168
    char data00[4];                         //172
    int32_t (*get_viewer_type)() = NULL;    //176
    int i176;                               //180
//    char data1[420];
    int i180;
    int i184;
    int i188;
    int i192;
    int i196;
    int i200;
    int i204;
    int i208;
    char data212[4];
    int i216;
    int i220;
    int i224;
    int i228;
    int i232;   // struct
    int i236;
    int i240;
    int i244;
    int i248;
    int i252;
    int i256;
    int i260;
    int i264;
    int i268;
    int i272;
    int i276;
    int i280;   // end struct

    int i284;
    int i288;
    int i292;
    int i296;
    int i300;
    int i304;
    int i308;
    int i312;

    char data316[4];
    char data320[4];
    char data324[4];
    char data328[4];
    char data332[4];
    int i336;
    char data340[4];
    int i344;
    int i348;
    int i352;
    int i356;
    int i360;
    int i364;
    int i368;
    int i372;
    int i376;
    int i380;
    uint32_t i384;
    int i388;
    int i392;
    char data396[4];
    char data400[4];
    char data404[4];
    char data408[4];
    char data412[4];
    char data416[4];
    char data420[4];
    char data424[4];
    char data428[4];
    char data432[4];
    char data436[4];
    char data440[4];
    char data444[4];
    char data448[4];
    char data452[4];
    char data456[4];
    char data460[4];
    char data464[4];
    char data468[4];
    char data472[4];
    char data476[4];
    char data480[4];
    char data484[4];
    char data488[4];
    st112198* p492;
    int i496;
    char data500[4];
    char data504[4];
    char data508[4];
    char data512[4];
    char data516[4];
    char data520[4];
    char data524[4];
    char data528[4];
    char data532[4];
    char data536[4];
    char data540[4];
    st114D98 * p544;
    int i548;
    char data552[4];
    char data556[4];
    char data560[4];
    char data564[4];
    char data568[4];
    char data572[4];
    char data576[4];
    char data580[4];
    char data584[4];
    char data588[4];
    char data592[4];
    char data596[4];

}gvr_user_prefs;


/// Primary context for invoking Google VR APIs.
typedef struct gvr_context_mj{
    gvr_user_prefs *user_prefs;
    int32_t errorno;
    void *sub24738_2;
    void *sub24738_3;
    void *sub24738_4;
    void *sub24738_5;
    uint32_t flag;
}gvr_context;


/// An enum for the left and right eye.
typedef enum {
  GVR_LEFT_EYE = 0,
  GVR_RIGHT_EYE,
  GVR_NUM_EYES
} gvr_eye;

/// The type of VR viewer.
typedef enum {
  /// A Cardboard-compatible viewer. A typical Cardboard viewer supports a
  /// simple touchscreen-based trigger input mechanism. On most platforms, this
  // is the default viewer type if no viewer has been explicitly paired.
  GVR_VIEWER_TYPE_CARDBOARD = 0,
  /// A Daydream-compatible viewer. A typical Daydream viewer supports 3DOF
  /// controller input (as defined in gvr_controller.h), and is intended only
  /// for Daydream-ready platforms. It does *not* support touchscreen-based
  /// input unless Cardboard emulation is explicitly enabled.
  GVR_VIEWER_TYPE_DAYDREAM = 1,
} gvr_viewer_type;

// Types of VR-specific features which may or may not be supported on the
// underlying platform.
typedef enum {
  // Asynchronous reprojection warps the app's rendered frame using the most
  // recent head pose just before pushing the frame to the display.
  GVR_FEATURE_ASYNC_REPROJECTION = 0,
  // Support for framebuffers suitable for rendering with the GL_OVR_multiview2
  // and GL_OVR_multiview_multisampled_render_to_texture extensions.
  GVR_FEATURE_MULTIVIEW = 1,
} gvr_feature;

/// @}

/// Version information for the Google VR API.
typedef struct gvr_version_ {
  int32_t major;
  int32_t minor;
  int32_t patch;
} gvr_version;

/// An integral 2D size. Used for render target sizes.
typedef struct gvr_sizei {
  int32_t width;
  int32_t height;
} gvr_sizei;

/// An integral 2D rect. Used for window bounds in pixels.
typedef struct gvr_recti {
  int32_t left;
  int32_t right;
  int32_t bottom;
  int32_t top;
} gvr_recti;

/// A floating point 2D rect. Used for field of view, and also for ranges
/// in texture space. When used for a field of view, all angles are in positive
/// degrees from the optical axis.
typedef struct gvr_rectf {
  float left;
  float right;
  float bottom;
  float top;
} gvr_rectf;

/// A floating point 2D vector.
typedef struct gvr_vec2f {
  float x;
  float y;
} gvr_vec2f;

/// A floating point 3D vector.
typedef struct gvr_vec3f {
  float x;
  float y;
  float z;
} gvr_vec3f;

/// A floating point 4x4 matrix.
typedef struct gvr_mat4f { float m[4][4]; } gvr_mat4f;

/// A floating point quaternion, in JPL format.
/// We use this simple struct in order not to impose a dependency on a
/// particular math library. The user of this API is free to encapsulate this
/// into any math library they want.
typedef struct gvr_quatf {
  /// qx, qy, qz are the vector component.
  float qx;
  float qy;
  float qz;
  /// qw is the linelar component.
  float qw;
} gvr_quatf;


/// Valid color formats for swap chain buffers.
typedef enum {
    /// Equivalent to GL_RGBA8
            GVR_COLOR_FORMAT_RGBA_8888 = 0,
    /// Equivalent to GL_RGB565
            GVR_COLOR_FORMAT_RGB_565 = 1,
} gvr_color_format_type;

typedef enum {
    /// No depth or stencil buffer.
            GVR_DEPTH_STENCIL_FORMAT_NONE = 255,
    /// Equivalent to GL_DEPTH_COMPONENT16.
            GVR_DEPTH_STENCIL_FORMAT_DEPTH_16 = 0,
    /// Equivalent to GL_DEPTH_COMPONENT24.
            GVR_DEPTH_STENCIL_FORMAT_DEPTH_24 = 1,
    /// Equivlaent to GL_DEPTH24_STENCIL8.
            GVR_DEPTH_STENCIL_FORMAT_DEPTH_24_STENCIL_8 = 2,
    /// Equivalent to GL_DEPTH_COMPONENT32F.
            GVR_DEPTH_STENCIL_FORMAT_DEPTH_32_F = 3,
    /// Equivalent to GL_DEPTH_32F_STENCIL8.
            GVR_DEPTH_STENCIL_FORMAT_DEPTH_32_F_STENCIL_8 = 4,
    /// Equivalent to GL_STENCIL8.
            GVR_DEPTH_STENCIL_FORMAT_STENCIL_8 = 5,
} gvr_depth_stencil_format_type;

/// Types of asynchronous reprojection.
typedef enum {
    /// Do not reproject.
    GVR_REPROJECTION_NONE = 0,
    /// Reproject in all dimensions.
    GVR_REPROJECTION_FULL = 1,
} gvr_reprojection;


/// A *monotonic system time* representation. On Android, this is equivalent to
/// System.nanoTime(), or clock_gettime(CLOCK_MONOTONIC). If there is any doubt
/// about how to get the current time for the current platform, simply use
/// gvr_get_time_point_now().
typedef struct gvr_clock_time_point {
  int64_t monotonic_system_time_nanos;
} gvr_clock_time_point;

/// A structure that ties together a region of a buffer, the field of view
/// rendered into that region and a target eye index to define part of the
/// user's field of view. The SDK implementation uses this information to
/// transform the images generated by the app output into the final display that
/// is sent to the screen.
///
/// A set of these structures will most often be generated by the API, via
/// gvr_get_recommended_buffer_viewports() or
/// gvr_get_screen_buffer_viewports(). However, the client may also customize
/// these values via gvr_buffer_viewport_list_set(), constructing a custom
/// gvr_buffer_viewport_list for use in the distortion pass.
typedef struct gvr_buffer_viewport_mj
{
//   char data[112] ;
    gvr_rectf view;          //16
    gvr_mat4f transformMat;  //80
    gvr_eye eye;             //84
    int buffer_index; 	     //88
    char data1[8];    		 //96
    int layer_index;		 //100
    char data11[4];          //104
    gvr_reprojection reprojection; //108
    char data2[4];    //112
}gvr_buffer_viewport;

/// List of buffer viewports that completely specifies how to transform the
/// frame's buffers into the image displayed on the screen.
typedef struct gvr_buffer_viewport_list_mj
{
    char data[16];
}gvr_buffer_viewport_list;

/// Specification of a pixel buffer. A pixel buffer can have color, depth and
/// stencil attachments and mostly corresponds to the OpenGL concept of a
/// framebuffer object. However, since there can be multiple such objects for
/// each frame, we avoid calling them "framebuffers". Pixel buffers which are
/// part of the currently acquired frame are immutable, i.e., they cannot be
/// resized or otherwise reconfigured.
//typedef struct gvr_buffer_spec_ gvr_buffer_spec;
typedef struct gvr_buffer_spec_mj
{
//    int32_t width;
//    int32_t height;
    gvr_sizei size;
    gvr_depth_stencil_format_type depth_stencil_format;
    gvr_color_format_type color_format;
    int32_t num_samples;
    int32_t num_layers;
